Core/src/src/Documents/ПлатежнаяВедомость/ПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежнаяВедомость</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПлатежнаяВедомость</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДокументОснование</name>
    <type>
      <types>DocumentRef.НачислениеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасчетов</name>
    <comment>ONESOFT-3523</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторВИнтернетБанке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <comment>ONESOFT-3849</comment>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Enums/ТипЛгот/ТипЛгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЛгот</name>
  <enumValues>
    <name>УдержаниеДляКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/СотрудникиПрисоединенныеФайлы/СотрудникиПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СотрудникиПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Одобрен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Documents/ПлатежнаяВедомость/Forms/ФормаДокумента/Module.bsl
#Область Служебные

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКомандуПечати(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ЗаполнитьПоОстаткамНаСервере()	
	
	Документ = РеквизитФормыВЗначение("Объект");
	//Документ.ЗаполнитьПоОстаткамНаСервере();
	Документ.ЗаполнитьПоОстаткамНаСервере_Новый();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	//Для Каждого ТекСтрока Из Объект.Сотрудники Цикл 
	//	СтавкаПФ	= 0;
	//	СтавкаНДФЛ 	= 0;
	//	//Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияПФ) Тогда
	//	//	СтавкаПФ = ТекСтрока.ВидУдержанияПФ.СтавкаПФ;
	//	//КонецЕсли;
	//	//ТекСтрока.СуммаПФПлатежа	= Окр((ТекСтрока.СуммаПлатежа + ТекСтрока.НДФЛПлатежа) * СтавкаПФ/(100 - СтавкаПФ), 2);
	//	//+++ Дмгг
	//	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ) Тогда
	//		СтавкаНДФЛ = ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияПФ) Тогда
	//		СтавкаПФ = ТекСтрока.ВидУдержанияПФ.СтавкаПФ;
	//	КонецЕсли;
	//	
	//	ТекСтрока.НДФЛПлатежа		= Окр(ТекСтрока.СуммаПлатежа * СтавкаНДФЛ/(100 - СтавкаНДФЛ), 2);
	//	ТекСтрока.СуммаПФПлатежа	= Окр((ТекСтрока.СуммаПлатежа + ТекСтрока.НДФЛПлатежа) * СтавкаПФ/(100 - СтавкаПФ), 2);
	//	
	//	//РасчитатьСуммы_ПФ_НДФЛ(ТекСтрока);
	//	
	//	//--- Дмгг
	//КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервере
// Процедура заполняет табличную часть Сотрудники по подразделению.
//
Процедура ЗаполнитьПоПодразделениюНаСервере()	
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьПоПодразделениюНаСервере();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	СтруктураДанные.Вставить("ПодписьРуководителя", Организация.ПодписьРуководителя);
	СтруктураДанные.Вставить("ПодписьГлавногоБухгалтера", Организация.ПодписьГлавногоБухгалтера);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаКлиенте
// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ПересчитатьСуммуПоВалюте(СтрокаТабличнойЧасти, ИзмененоНачисление, ИзмененоКВыдаче, ДополнительныеПараметры = Неопределено)
	
	//
	// Если изменены обе валюты, расчет суммы выдачи происходит по сумме начисления
	//
	
	Если ИзмененоНачисление Тогда
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			
			СтрокаТабличнойЧасти.СуммаРасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.СуммаРасчетов, ДополнительныеПараметры.ВалютаРасчетовПередИзменением, Объект.ВалютаРасчетов, ДополнительныеПараметры.КурсПередИзменением, Объект.Курс, ДополнительныеПараметры.КратностьПередИзменением, Объект.Кратность);
			
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СуммаПлатежа = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.СуммаРасчетов, Объект.ВалютаРасчетов, Объект.ВалютаДокумента, Объект.Курс, КурсВалютаДокумента, Объект.Кратность, КратностьВалютаДокумента);
		
	ИначеЕсли ИзмененоКВыдаче Тогда
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			
			СтрокаТабличнойЧасти.СуммаПлатежа = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.СуммаПлатежа, ДополнительныеПараметры.ВалютаДокументаПередИзменением, Объект.ВалютаДокумента, ДополнительныеПараметры.КурсВалютаДокументаПередИзменением, КурсВалютаДокумента, ДополнительныеПараметры.КратностьВалютаДокументаПередИзменением, КратностьВалютаДокумента);
			
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СуммаРасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.СуммаПлатежа, Объект.ВалютаДокумента, Объект.ВалютаРасчетов, КурсВалютаДокумента, Объект.Курс, КратностьВалютаДокумента, Объект.Кратность);
		
	КонецЕсли;
	
	РасчитатьСуммы_ПФ_НДФЛ(Элементы.Сотрудники.ТекущаяСтрока);//Паганини ПФ
	
КонецПроцедуры

&НаСервере
// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура УстановитьВидимостьОтВалюты()
	
	ВалютаРасчетовОтличаетсяОтВалютыДокумента = (Объект.ВалютаДокумента <> Объект.ВалютаРасчетов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиСуммаРасчетов", "Видимость", ВалютаРасчетовОтличаетсяОтВалютыДокумента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиИтогСуммаРасчетов", "Видимость", ВалютаРасчетовОтличаетсяОтВалютыДокумента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиВалютаРасчетов", "Видимость", ВалютаРасчетовОтличаетсяОтВалютыДокумента);
	
	//Малышев 2024-10-20 ONESOFT-3523
	Элементы.СотрудникиСуммаРасчетов.Заголовок = НСтр("ka='დარიცხული';ru='Начислено';en='credited with'") + " " + Объект.ВалютаРасчетов;
	Элементы.СотрудникиСуммаПлатежа.Заголовок = НСтр("ka='გადახდისთვის';ru='К выплате';en='To payoff'") + " " + Объект.ВалютаДокумента;
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняет пересчет в табличной части документа после изменений 
// в форме "Цены и валюта".Выполняется пересчет колонок: цена, скидка, сумма,
// сумма НДС, всего.
//
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПересчитатьЦены = Ложь)
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ВалютаДокумента",			Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("КурсВалютаДокумента",		КурсВалютаДокумента);
	СтруктураПараметров.Вставить("КратностьВалютаДокумента",КратностьВалютаДокумента);
	
	СтруктураПараметров.Вставить("ВалютаРасчетов",			Объект.ВалютаРасчетов);
	СтруктураПараметров.Вставить("Курс",					Объект.Курс);
	СтруктураПараметров.Вставить("Кратность",				Объект.Кратность);
	
	СтруктураПараметров.Вставить("Организация",				Компания);
	СтруктураПараметров.Вставить("ДатаДокумента",			Объект.Дата);
	СтруктураПараметров.Вставить("ПересчитатьЦеныПоВалюте",	Ложь);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",	Ложь);
	
	СтруктураЦеныИВалюта = Неопределено;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВалютаРасчетовПередИзменением", Объект.ВалютаРасчетов);
	ДополнительныеПараметры.Вставить("КурсПередИзменением" ,Объект.Курс);
	ДополнительныеПараметры.Вставить("КратностьПередИзменением" ,Объект.Кратность);
	
	ДополнительныеПараметры.Вставить("ВалютаДокументаПередИзменением", Объект.ВалютаДокумента);
	ДополнительныеПараметры.Вставить("КурсВалютаДокументаПередИзменением" ,КурсВалютаДокумента);
	ДополнительныеПараметры.Вставить("КратностьВалютаДокументаПередИзменением" ,КратностьВалютаДокумента);
	
	ОткрытьФорму("Документ.ПлатежнаяВедомость.Форма.ФормаВалюта", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение", ЭтотОбъект, ДополнительныеПараметры), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураЦеныИВалюта = Результат;
	Если ТипЗнч(СтруктураЦеныИВалюта) = Тип("Структура") И СтруктураЦеныИВалюта.БылиВнесеныИзменения Тогда
		
		Объект.ВалютаДокумента		= СтруктураЦеныИВалюта.ВалютаДокумента;
		КурсВалютаДокумента			= СтруктураЦеныИВалюта.КурсВалютаДокумента;
		КратностьВалютаДокумента	= СтруктураЦеныИВалюта.КратностьВалютаДокумента;
		
		Объект.ВалютаРасчетов 	= СтруктураЦеныИВалюта.ВалютаРасчетов;
		Объект.Курс 			= СтруктураЦеныИВалюта.Курс;
		Объект.Кратность 		= СтруктураЦеныИВалюта.Кратность;
		
		// Пересчитываем цены по валюте.
		Если СтруктураЦеныИВалюта.ПересчитатьЦеныПоВалюте Тогда
			
			Для каждого СтрокаТабличнойЧасти Из Объект.Сотрудники Цикл
				
				ПересчитатьСуммуПоВалюте(СтрокаТабличнойЧасти, СтруктураЦеныИВалюта.ИзмененаВалютаРасчетов, СтруктураЦеныИВалюта.ИзмененаВалютаДокумента, ДополнительныеПараметры);
				
			КонецЦикла; 
			
		ИначеЕсли СтруктураЦеныИВалюта.ВалютаРасчетов <> ДополнительныеПараметры.ВалютаРасчетовПередИзменением 
			И СтруктураЦеныИВалюта.ВалютаДокумента <> ДополнительныеПараметры.ВалютаДокументаПередИзменением Тогда
			
			// пропустить
			
		ИначеЕсли СтруктураЦеныИВалюта.ВалютаРасчетов <> ДополнительныеПараметры.ВалютаРасчетовПередИзменением 
			ИЛИ СтруктураЦеныИВалюта.ВалютаДокумента <> ДополнительныеПараметры.ВалютаДокументаПередИзменением Тогда
			
			Для каждого СтрокаТабличнойЧасти Из Объект.Сотрудники Цикл
				
				ПересчитатьСуммуПоВалюте(СтрокаТабличнойЧасти, Ложь, Истина, ДополнительныеПараметры);
				
			КонецЦикла; 
			
		КонецЕсли;
		
		УстановитьВидимостьОтВалюты();
		Модифицированность = Истина;//Паганини
		
	КонецЕсли;
	
	// Заполним данные формы.
	ЦеныИВалюта = НСтр("ka='დოკ %1 • დასაწყ. %2';ru='Док %1 • Нач. %2';en='Doc% 1 • Early. 2%'");
	ЦеныИВалюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЦеныИВалюта, СокрЛП(Строка(Объект.ВалютаДокумента)), СокрЛП(Строка(Объект.ВалютаРасчетов)));
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

#КонецОбласти

#Область Форма

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
// В процедуре осуществляется
// - инициализация параметров формы,
// - установка параметров функциональных опций формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	Если Объект.ВалютаРасчетов = Объект.ВалютаДокумента Тогда
		
		КурсВалютаДокумента = Объект.Курс;
		КратностьВалютаДокумента = Объект.Кратность;
		
	Иначе
		
		КурсВалютыДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
		КурсВалютаДокумента = КурсВалютыДокумента.Курс;
		КратностьВалютаДокумента = КурсВалютыДокумента.Кратность;
		
	КонецЕсли;
	
	// Заполним данные формы.
	ЦеныИВалюта = НСтр("ka='დოკ. %1 • დასაწყ. %2';ru='Док. %1 • Нач. %2';en='Doc. 1% • Early. 2%'");
	ЦеныИВалюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЦеныИВалюта, СокрЛП(Строка(Объект.ВалютаДокумента)), СокрЛП(Строка(Объект.ВалютаРасчетов)));
	
	УстановитьВидимостьОтВалюты();
	//Паганини#Удержания_
	УстановитьВидимостьОтОперации();
	//_Паганини#Удержания
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
		Если Элементы.Найти("СотрудникиСотрудникКод") <> Неопределено Тогда
			Элементы.СотрудникиСотрудникКод.Видимость = Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы ОбработкаВыбора
//
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации = КонецДня(ВыбранноеЗначение);
		УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ДекорацияПечатьНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиПлатежнаяВедомость", Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ЗаполнитьИРассчитатьВыполнить формы.
//
Процедура ЗаполнитьПоОстаткам(Команда)
	
	//Паганини#Удержания_
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента") Тогда
		ЗаполнитьПоОстаткамНаСервере();
		Возврат;
	КонецЕсли;
	//_Паганини#Удержания
	
	//Малышев 2025-02-12 ONESOFT-3849
	//Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) и Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента") Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ქვეგანყოფილება შეუვსებელია!';ru='Не заполнено подразделение!';en='Not filled unit!'");
		Сообщение.Поле = "Объект.СтруктурнаяЕдиница";
	 	Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьПоОстаткамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПодразделению(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ქვეგანყოფილება შეუვსებელია!';ru='Не заполнено подразделение!';en='Not filled unit!'");
		Сообщение.Поле = "Объект.СтруктурнаяЕдиница";
 		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьПоПодразделениюНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события Регулирования реквизита ПериодРегистрации
//
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойКлиент.ПриРегулированииПериодаРегистрации(ЭтотОбъект, Направление);
	УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события НачалоВыбора реквизита ПериодРегистрации
//
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;
	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, УправлениеНебольшойФирмойПовтИсп.ПолучитьТекущуюДатаСеанса());
	
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", УправлениеНебольшойФирмойКлиент.ПолучитьПараметрыОткрытияФормыКалендаря(ДатаКалендаряПриОткрытии), ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Реквизиты

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Организация.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
	Объект.ПодписьРуководителя = СтруктураДанные.ПодписьРуководителя;
	Объект.ПодписьГлавногоБухгалтера = СтруктураДанные.ПодписьГлавногоБухгалтера;
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода СуммаРасчетов.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура СуммаРасчетовПриИзменении(Элемент)
	
	ПересчитатьСуммуПоВалюте(Элементы.Сотрудники.ТекущиеДанные, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода СуммаРасчетов.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура СотрудникиСуммаПлатежаПриИзменении(Элемент)
	
	ПересчитатьСуммуПоВалюте(Элементы.Сотрудники.ТекущиеДанные, Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события Нажатие поля ЦеныИВалюта.
//
Процедура ЦеныИВалютаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	
КонецПроцедуры // ЦеныИВалютаНажатие()

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область ПаганиниПФ

&НаКлиенте
Процедура СотрудникиВидУдержанияНДФЛПриИзменении(Элемент)
	РасчитатьСуммы_ПФ_НДФЛ(Элементы.Сотрудники.ТекущаяСтрока);//Паганини ПФ
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВидУдержанияПФПриИзменении(Элемент)
	РасчитатьСуммы_ПФ_НДФЛ(Элементы.Сотрудники.ТекущаяСтрока);//Паганини ПФ
КонецПроцедуры

&НаСервере
Процедура РасчитатьСуммы_ПФ_НДФЛ(Идентификатор)
	
	СтавкаНДФЛ	= 0;
	СтавкаПФ	= 0;
	
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		ТекСтрока = Объект.Сотрудники.НайтиПоИдентификатору(Идентификатор);
	Иначе
		ТекСтрока = Идентификатор; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ) Тогда
		СтавкаНДФЛ = ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекСтрока.ВидУдержанияПФ) Тогда
		СтавкаПФ = ТекСтрока.ВидУдержанияПФ.СтавкаПФ;
	КонецЕсли;
	
	СтрукОтвета = ПолучитьСуммоНалоговыхЛгот(Объект.Организация,ТекСтрока.Сотрудник,Объект.СтруктурнаяЕдиница,Объект.ПериодРегистрации);
	СуммаЛгот = СтрукОтвета.Сумма;
	ПроцентПодоходного = СтрукОтвета.ПроцентПодоходного;
	СуммаПлатежа = ТекСтрока.СуммаПлатежа;
	СтавкаЛгот = СтавкаНДФЛ-ПроцентПодоходного;
	
	Если СтавкаЛгот < 0 Тогда
		СтавкаЛгот = 0
	КонецЕсли;	
	
	НДФЛЛгот = СуммаЛгот * (СтавкаЛгот/100);	
	НэтЛгот = СуммаЛгот - НДФЛЛгот;
	
	Если НэтЛгот >= СуммаПлатежа Тогда	
		
		Если СуммаПлатежа/((100-СтавкаЛгот)/100) < СуммаЛгот Тогда
			СуммаДляНалогов = 0;
			СуммаЛгот = СуммаПлатежа/((100-СтавкаЛгот)/100); 
		Иначе
			СуммаДляНалогов = Окр(СуммаПлатежа /((100-СтавкаЛгот)/100),2) - СуммаЛгот;
			СуммаЛгот = СуммаЛгот;
		КонецЕсли;	
		
		НДФЛБезЛгот = Окр((СуммаДляНалогов) /((100-СтавкаНДФЛ)/100), 2) - СуммаДляНалогов;
		НДФЛЛгот    = Окр((СуммаЛгот) - СуммаЛгот*((100-СтавкаЛгот)/100),2);
		
	Иначе		
		НДФЛБезЛгот = Окр((СуммаПлатежа - НэтЛгот)/((100-СтавкаНДФЛ)/100) - (СуммаПлатежа - НэтЛгот),2);			
	КонецЕсли;	
		
		
	ТекСтрока.НДФЛПлатежа		= НДФЛБезЛгот + НДФЛЛгот;
	ТекСтрока.СуммаЛгот = СуммаЛгот;
	ТекСтрока.СуммаПФПлатежа	= Окр((ТекСтрока.СуммаПлатежа + ТекСтрока.НДФЛПлатежа) * СтавкаПФ/(100 - СтавкаПФ), 2);
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата) 
	
	СтрукОтвета = Новый Структура;
	СтрукОтвета.Вставить("Сумма",0);
	СтрукОтвета.Вставить("ПроцентПодоходного",20);
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда
		СтрукОтвета = РС_ОбщегоНазначения.ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата+1);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НалоговыеЛготыОстатки.Сотрудник,
	               |	НалоговыеЛготыОстатки.СуммаОстаток КАК Сумма,
	               |	НалоговыеЛготыОстатки.Организация,
	               |	НалоговыеЛготыОстатки.Подразделение,
	               |	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного
	               |ИЗ
	               |	РегистрНакопления.НалоговыеЛготы.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Подразделение = &Подразделение
	               |				И Сотрудник = &Сотрудник
	               |				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалоговыеЛготыИнформация.СрезПоследних КАК НалоговыеЛготыИнформацияСрезПоследних
	               |		ПО НалоговыеЛготыОстатки.Организация = НалоговыеЛготыИнформацияСрезПоследних.Организация
	               |			И НалоговыеЛготыОстатки.Сотрудник = НалоговыеЛготыИнформацияСрезПоследних.Сотрудник
	               |			И НалоговыеЛготыОстатки.Подразделение = НалоговыеЛготыИнформацияСрезПоследних.Подразделение";
	
	
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Дата",Дата+1);
	Запрос.УстановитьПараметр("Организация",Организация);	
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		Запрос.УстановитьПараметр("ТипЛгот",Перечисления.ТипЛгот.УдержаниеДляКонтрагента);
	Иначе
		Запрос.УстановитьПараметр("ТипЛгот",Перечисления.ТипЛгот.Прочее);
	КонецЕсли;
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрукОтвета.Сумма = СтрукОтвета.Сумма + Выборка.Сумма;
		СтрукОтвета.ПроцентПодоходного = Выборка.ПроцентПодоходного;
	КонецЕсли; 
	
	Возврат СтрукОтвета;
	
КонецФункции	


//Паганини#Удержания_
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимостьОтОперации();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтОперации()
	
	УдержаниеДляКонтрагента = (Объект.ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента);
	Элементы.СотрудникиВидУдержания.Видимость 		= УдержаниеДляКонтрагента;
	Элементы.Аванс.Видимость 						= УдержаниеДляКонтрагента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

//_Паганини#Удержания

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Kuzmich, 13.01.2020, Запрет проведения документов зарплаты, если нет присоединенных файлов.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабСотрудники.Сотрудник,
	|	ТабСотрудники.НомерСтроки
	|ПОМЕСТИТЬ ПлатежнаяВедомостьСотрудники
	|ИЗ
	|	&ТабСотрудники КАК ТабСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.НомерСтроки
	|ИЗ
	|	Справочник.СотрудникиПрисоединенныеФайлы КАК СотрудникиПрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПлатежнаяВедомостьСотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ПО СотрудникиПрисоединенныеФайлы.ВладелецФайла = ПлатежнаяВедомостьСотрудники.Сотрудник
	|			И (НЕ СотрудникиПрисоединенныеФайлы.Одобрен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлатежнаяВедомостьСотрудники.Сотрудник,
	|	ПлатежнаяВедомостьСотрудники.НомерСтроки";
	
	Запрос.УстановитьПараметр("ТабСотрудники", Объект.Сотрудники.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='თანამშრომელმა %1 არ წარადგინა ყველა აუცილებელი დოკუმენტი';ru='Сотрудник %1 не принес все необходимые документы'"),
		ВыборкаДетальныеЗаписи.Сотрудник);
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Объект,СтрокаСообщения,"Сотрудники",ВыборкаДетальныеЗаписи.НомерСтроки,"Сотрудник",Отказ);
		Отказ = ИСТИНА;
	КонецЦикла;
	// Kuzmich, 13.01.2020, Запрет проведения документов зарплаты, если нет присоединенных файлов.
КонецПроцедуры
